using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace CAD.Nomenclature
{
    /// <summary>
    /// Съдържа кодове за тип на точка от геодезическа снимачна основа
    /// </summary>
    public static class CADPointType
    {
        /// <summary>
        /// Връща тип на точка от геодезическа снимачна основа
        /// </summary>
        /// <param name="code"></param>
        /// <returns></returns>
        public static string Get(int code)
        {
            return points.ContainsKey(code)
                ? points[code]
                : null;
        }

        private static readonly Dictionary<int, string> points = new Dictionary<int, string>()
        {
            {1,"Астрономическа точка"},
            {2,"Триангулачна точка на терена"},
            {3,"Триангулачна точка на църква"},
            {4,"Триангулачна точка на комин"},
            {5,"Триангулачна точка на гръмоотвод"},
            {6,"Триангулачна точка на минаре"},
            {7,"Триангулачна точка с кота, определена с геометрична нивелация"},
            {8,"Триангулачна точка на могила"},
            {9,"Точка от прецизна полигонометрия"},
            {10,"Полигонова точка, стабилизирана с дървен кол"},
            {11,"Полигонова точка, стабилизирана с бетонно блокче"},
            {12,"Полигонова точка, стабилизирана с желязна тръба"},
            {13,"Полигонова точка, стабилизирана на скала"},
            {14,"Точка от прецизна тригонометрия"},
            {15,"Осова точка"},
            {16,"Гравиметрична точка"},
            {17,"Засечка с теодолит"},
            {18,"Точка от строителна мрежа"},
            {19,"Възлова точка"},
            {20,"Трайно стабилизирана полигонова точка"},
            {21,"Операционна точка"},
            {22,"Нетрайно стабилизирана полигонова точка"},
            {23,"Теренна точка"},
            {24,"Точка от графическа засечка"},
            {25,"Нивелачен репер I,II,III и IV клас"},
            {26,"Нивелачен репер I,II,III и IV клас на сграда"},
            {27,"Височинна опорна точка"},
            {28,"Подробна точка"},
            {29,"Осова точка от регулационен план(червено кръгче с диаметър 2 mm и с дебелина на линията 0,2 mm)"},
            {30,"Определяща точка, означена с регламентиран знак"},
            {31,"Изходна точка за определяне на морската граница"}
        };
    }
}
